app/views/charges/index.html.erb

      <tr class="list1-background">
      	<td><%= charge.customer.firstname %></td>
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT 1  [["id", 52]]